Tekla Open API Reference for Tekla Structures 2025
DistanceList.RemoveAt Method
 Removes an item at the specified position.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RemoveAt(
	int index
)
Public Sub RemoveAt (
	index As Integer
)
Parameters
index
Type: System.Int32
The index of the item to be removed.
Implements
IList<T>.RemoveAt(Int32)
Examples
 This example shows how to remove a Distance instance from the beginning of a DistanceList.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           Distance[] distances = { new Distance(30.2), new Distance(2.3) };
           DistanceList distanceList = new DistanceList(distances);
           // Distance can be removed at any position using the DistanceList.RemoveAt method.
           distanceList.RemoveAt(1);
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace